#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2IARHGO3S8MHZ]
aws_route53_zone.davidbornitz: Refreshing state... [id=Z04601461HBLV7APEL0VR]
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=resume.davidbornitz.dev]
module.s3origin["davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=davidbornitz.dev]
aws_acm_certificate.davidbornitz: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb]
aws_route53_record.cert_validation["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_route53_record.cert_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_acm_certificate_validation.davidbornitz: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.s3origin["davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=davidbornitz.dev]
module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=resume.davidbornitz.dev]
module.s3origin["davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3origin["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=3524774637]
module.s3origin["resume.davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3origin["davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3origin["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=405747234]
module.s3origin["resume.davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev]
module.s3origin["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev]
aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=E23A18Y83ZWJHV]
aws_route53_record.record["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR_davidbornitz.dev_A]
module.bucket-access["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.bucket-access["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
aws_route53_record.record["resume.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR_resume.davidbornitz.dev_A]
module.bucket-access["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=3556308804]
module.bucket-access["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2012964748]
module.bucket-access["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev]
module.bucket-access["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.s3origin["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
        id     = "davidbornitz.dev"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::085879623427:distribution/E23A18Y83ZWJHV"
                            }
                        } -> null
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.s3origin["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be updated in-place
  ~ resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
        id     = "resume.davidbornitz.dev"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::085879623427:distribution/E23A18Y83ZWJHV"
                            }
                        } -> null
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3website["davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz will be created
  + resource "aws_cloudfront_distribution" "davidbornitz" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "davidbornitz.dev"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "davidbornitz.dev"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.s3website["davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz will be created
  + resource "aws_cloudfront_origin_access_control" "davidbornitz" {
      + description                       = "Allow Only Cloudfront"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "davidbornitz"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.s3website["davidbornitz.dev"].aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3website["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3website["davidbornitz.dev"].aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # module.s3website["davidbornitz.dev"].random_id.bucket will be created
  + resource "random_id" "bucket" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_cloudfront_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3website["resume.davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz will be created
  + resource "aws_cloudfront_distribution" "davidbornitz" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "resume.davidbornitz.dev"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "resume.davidbornitz.dev"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.s3website["resume.davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz will be created
  + resource "aws_cloudfront_origin_access_control" "davidbornitz" {
      + description                       = "Allow Only Cloudfront"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "davidbornitz"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.s3website["resume.davidbornitz.dev"].aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access will be created
  + resource "aws_s3_bucket_policy" "allow_cloudfront_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "error.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

  # module.s3website["resume.davidbornitz.dev"].random_id.bucket will be created
  + resource "random_id" "bucket" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 12 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*